In [2]:
import pandas as pd
df = pd.read_csv("pokemon.csv")

In [4]:
df[:10]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False

In [6]:
df.describe()

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.00000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,435.10250,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,119.96304,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,180.00000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,330.00000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,450.00000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,515.00000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,780.00000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

In [13]:
df["Name"]

0                  Bulbasaur
1                    Ivysaur
2                   Venusaur
3      VenusaurMega Venusaur
4                 Charmander
               ...
795                  Diancie
796      DiancieMega Diancie
797      HoopaHoopa Confined
798       HoopaHoopa Unbound
799                Volcanion
Name: Name, Length: 800, dtype: object

In [22]:
df[df["Speed"] > 100][["Name", "Speed"]].sort_values("Speed", ascending=False)

                        Name  Speed
431        DeoxysSpeed Forme    180
315                  Ninjask    160
429       DeoxysAttack Forme    150
428       DeoxysNormal Forme    150
71     AlakazamMega Alakazam    150
..                       ...    ...
22                   Pidgeot    101
708  LandorusIncarnate Forme    101
573                 Simisear    101
571                 Simisage    101
705   ThundurusTherian Forme    101

[106 rows x 2 columns]

In [29]:
df[["Type 1", "HP"]].groupby("Type 1").mean()

                 HP
Type 1
Bug       56.884058
Dark      66.806452
Dragon    83.312500
Electric  59.795455
Fairy     74.117647
Fighting  69.851852
Fire      69.903846
Flying    70.750000
Ghost     64.437500
Grass     67.271429
Ground    73.781250
Ice       72.000000
Normal    77.275510
Poison    67.250000
Psychic   70.631579
Rock      65.363636
Steel     65.222222
Water     72.062500

In [32]:
df.melt()

        variable value
0              #     1
1              #     2
2              #     3
3              #     3
4              #     4
...          ...   ...
10395  Legendary  True
10396  Legendary  True
10397  Legendary  True
10398  Legendary  True
10399  Legendary  True

[10400 rows x 2 columns]